In [1]:
import pandas as pd
import numpy as np

In [5]:

test_series = pd.DataFrame([{'account': 'Jones LLC', 'Jan': 150, 'Feb': 200, 'Mar': 140},
         {'account': 'Alpha Co',  'Jan': 200, 'Feb': 210, 'Mar': 215},
         {'account': 'Blue Inc',  'Jan': 50,  'Feb': 90,  'Mar': 95 },
                           {'account': 'Jones LLC', 'Jan': 1350, 'Feb': 1200, 'Mar': 1404},
                            {'account': 'Alpha Co',  'Jan': 300, 'Feb': 400, 'Mar': 500}])
test_series

    Feb   Jan   Mar    account
0   200   150   140  Jones LLC
1   210   200   215   Alpha Co
2    90    50    95   Blue Inc
3  1200  1350  1404  Jones LLC
4   400   300   500   Alpha Co

In [7]:
another = pd.DataFrame([{'account': 'Jones LLC', 'Mar': 140},
                        {'account': 'Alpha Co',  'Jan': 300, 'Feb': 400, 'Mar': 500}])
another

     Feb    Jan  Mar    account
0    NaN    NaN  140  Jones LLC
1  400.0  300.0  500   Alpha Co

In [ ]:
def test_value():
    
    return
test_series['new_col'] = test_series